<template id="template">
    <section>
        <div class="pec-list pec-margin-top20 ">
            <div class="pec-list-item">
                <div class="pec-item-body">
                    <p class="pec-color-63666B">3、	提前支取时收益如何计算？</p>
                </div>
            </div>
        </div>
        <div class="answers-01">
               	 该产品从存入当天就开始计算收益，存几天都可以，随时支取，支取的时候可以选择“实时支取”或“T+1到账支取”，不同的支取方式收益计算方式不同，若选择“实时支取”，则根据本金实际存期最接近（小于等于实际存期）的挂牌利率期限，按照存入日相应期限的定期挂牌利率计付利息。若选择“T+1到账支取”，支取的时候按照所存天数，以支取当日公布的支取收益率计算收益，操作支取当日不计算收益。若产品一直未支取并持有到期，则按存入时的到期利率计算本息。
          举例：客户于2017年1月1日存入50万元定活通（增强型），存期3年，产品年利率为3.575%。<br><br>
          1、	 ″若客户在3月1日实时支取10000元（实际存入刚好满3个月），若2017年1月1日的3个月定期挂牌利率为1.40%，则客户实时支取可收到的本金和利息合计10035.00元。
          （本金+利息=10000+10000*1.4%/12个月*3个月=10035.00元）<br><br>
          2、	 ″若客户在4月14日（周五）采用“T+1到账支取”20万元，且今日支取收益率为3.3%，客户在4月17日（周一）24：00前收到本金和收益合计201862.47元。
          （本金+利息=200000+200000*3.3%/365天*103天=201862.47元）
          ″若客户一直没有支取，则2020年1月1日将收到本息合计553625.00元
          （本金+利息=500000+500000*3.575% *3年=553625.00元）<br><br>
          3、	 “T+1”支取后本金和收益会在什么时候到账？
          “T+1到账支取”会在您提交支取申请日期的下一个交易日（同上海、深圳证券交易所的交易日期）24：00点前到账。特提请您留意的是，交易申请日和支取到账日期不是自然日，尤其是法定周末和节假日前应特别留意支取到账时间对您资金安排的影响。<br><br>

          4、	 “T+1到账支取”支取收益率是否固定？
          每日浮动，根据存款收益权受让方认可的市场价格进行调整，请您在支取时留意我行平台公布的支取利率及其变化。
        </div>
    </section>
</template>

<script>
    import {
            mapState,
            mapActions
    } from 'vuex';
    export default {
        data() {
            return {
                model: {

                }
            };
        },
        created: function () {
            //TODO： 请求数据回来
        },
        methods: {
            onBuy() {
                //TODO: to send buy request
                alert("on buy");
            }
        }
    }

    </script>
