<template>
<div>
<common-header  :options="options" @leftButtonCallback="leftButtonCallback"></common-header>
  <section>
    <div class="agreement">
      <h3 class="m_b20">平安银行定活通（增强型）支取服务协议</h3>
      <p class="m_b20">协议签订地及履行地：[深圳市罗湖区]</p>
      <p class="m_b20">特别提醒：鉴于您向平安银行平安银行股份有限公司（以下简称“我行”）申请开通本协议项下的“平安银行定活通（增强型）”服务（以下简称“本服务”），我行诚恳地建议您：在我行网站或其他与我行相关的软件客户端（以下简称“银行平台”）点击接受本协议之前，应事先了解清楚并充分理解本服务协议条款的全部内容。一旦您在我行任何银行平台点击接受本协议，即意味着您自愿向我行申请开通本服务，并已阅读、充分理解和接受本协议所有条款，同意接受本协议约束。</p>
      <p class="m_b20">为维护您的合法权益，提醒您特别关注本协议条款中的粗体及加下划线部分。如您无法准确理解或不同意本协议任一条款，请勿继续之后的流程；如有疑问，烦请致电我行客服电话【95511-3】。</p>
      <p class="m_b20">您同意，我行有权随时对本协议内容进行单方面的变更，并以在我行平台公告的方式提前予以公布，而无需另行单独通知您；若您在本协议内容公告变更生效后继续使用本服务的，表示您已充分阅读、理解并接受变更后的协议内容，也将遵照变更后的协议条款使用本服务；若您不同意变更后的协议条款，您应在变更生效前停止使用本服务。</p>
      <p class="m_b20">第一条 <span class="margin-left1">了解本服务</span></p>
      <p class="m_b20">定活通（增强型）支取服务是指我行为您提供的一款资金管理工具，为您提供资金的存入以及支取服务。您在使用本服务时须已开立我行账户。
      </p>
      <p class="f-700">一、存入</p>
      <p class="m_b20">1.1 您可以通过本服务主动将您的卡下活期账户（以我行平台页面展示为准）中的可用人民币资金存入定活通（增强型），以实现将活期存款转存电子定活通定期存款（以下简称“定期存款”）。</p>
      <p class="m_b20">1.2 本服务项下定期存款的最小起存金额（“起存金额”）为人民币[一万元整]。如您活期账户中的可用资金少于起存金额，您将无法使用本服务。</p>
      <p class="m_b20">1.3 本服务项下定期存款的存期为三年。您可以在我行平台页面查询相关存款信息，我行在本服务中将不向您提供纸质存单。</p>
      <p class="m_b20">1.4 本服务项下定期存款到期后按该笔定期存款开户日我行三年期大额存单存款利率计付利息。提前支取的情况根据本协议约定计息，本协议未约定的按法律法规规定执行。</p>
      <p class="m_b20">1.5 您理解并在此确认，我行有权随时设置、调整您在本服务项下定期存款的累计存入和持有的定期存款本金最高限额，具体限额以我行在银行平台的相关页面展示的为准。</p>
      <p class="f-700">二、支取</p>
      <p class="m_b20">1.6 支取定期存款时，我行不支持将该等款项入账至除原存入活期账户之外的其他账户。同时，您应遵循如下规定：</p>
      <p class="m_b20">(a)<span class="f-700 margin-left2">到期支取模式。</span>我行将在该笔定期存款到期日的24:00（北京时间）前（以银行实际入账时间为准），自动将该笔定期存款到期支取的全部本息款项转到您原存入本产品的活期账户内，您无需主动进行操作。到期兑付结息时执行的利率为该笔定期存款存入日对应的三年期大额存单存款利率。</p>
      <p class="m_b20">(b)<span class="f-700 margin-left2">"实时支取"支取模式。</span>在该笔定期存款到期日前，您可办理“实时支取”，在部分支取后，该笔定期存款余额应不低于存款的最小起存金额，否则应办理全额提前支取。在您选择“实时支取”模式支取本服务项下定期存款时，我行将按该笔定期存款实际已存入天数按如下具体规则计息：（i）存期不满7天，整个存期按存入日相应人民币定活通1天通知存款利率计息；（ii）存期7天以上（含7天）不满3个月，整个存期按存入日相应人民币定活通7天通知存款利率计息；（iii）存期3个月以上（含三个月）不满6个月，整个存期按存入日相应人民币定活通3个月存款利率计息；（iiii）存期6个月以上（含六个月）不满1年，整个存期按存入日相应人民币定活通6个月存款利率计息；（iiiii）存期1年以上（含1年）不满2年，整个存期按存入日相应人民币定活通1年存款利率计息；（iiiiii）存期2年以上（含2年）不满3年，整个存期按存入日相应人民币定活通2年存款利率计息。剩余未支取部分的存款到期时按该笔定期存款开户日我行三年期定活通存款利率计付利息。我行将您支取的本金和对应的利息入账至原存入的活期账户。</p>
      <p class="m_b20">(c)<span class="f-700 margin-left2">"T+1到账支取"支取模式。</span>在该笔定期存款到期前，您选择“T+1到账支取”模式支取定期存款的，即表示您同意按我行平台展示的“今日支取收益率”将该笔定期存款项下的收益权转让给第三方服务提供商。您需要就该笔转让与第三方服务提供商另行签署《定期存款收益权转让及定期存款质押合同》（“收益权转让合同”），转让的具体要求、条件及流程（包括付款流程）以“收益权转让合同”的条款约定为准。如您选择转让该笔定期存款项下部分本金所对应的收益权，则表示您授权我行根据您申请转让的本金数额，自动将原定期存款拆分为两笔定期存款，即包括一笔收益权转让项下所对应的定期存款和另一笔未转让部分金额所对应的定期存款。您理解并同意，我行可以不在银行平台页面展示已经完成收益权转让的定期存款。为避免歧义，已经全额支取的定期存款、部分支取的定期存款中已经支取的部分，不能进行收益权转让。为收益权转让之目的而拆分的定期存款，拆分后的定期存款的起息日、存期、到期日、利率均不受影响。</p>
      <p class="m_b20">第二条<span class="margin-left1">
      质押记录及授权</span></p>
      <p class="m_b20">2.1 为进行本协议第1.6(c)条规定的收益权转让之目的，一旦您提交该笔收益权转让申请，您在此授权我行直接向第三方服务提供商（作为收益权潜在的受让方）披露注册账户和拟转让存款的相关信息，包括但不限于户名、开户行、账号、账户状态、余额、存期、利率、到期日、自动转存标识以及冻结止付标识，以及有权机关要求查封、扣押、冻结、扣划的情况。</p>
      <p class="m_b20">2.2 根据本协议第1.6(c)条规定进行收益权转让后，您同意该第三方服务提供商（作为收益权的受让方）可以根据收益权转让合同中相应的授权条款或您另行作出的授权文件，以您的名义，代表您发出与原定期存款存入的活期账户和已转让定期存款的相关指令，我行视该等指令为由您本人发出的指令，并将据此执行，我行无义务进一步审核其真实性，亦无义务另行获得您的同意及确认。</p>
      <p class="m_b20">2.3 根据本协议第1.6(c)条规定进行收益权转让后，您同意我行根据收益权转让合同相应的约定对您已经进行收益权转让的电子定期存款的质押状态予以记录，并仅根据本协议第2.2条的规定执行第三方服务提供商以您的名义，代表您发出的指令。除此之外，我行将拒绝接受任何其他支取、划转指令。</p>
      <p class="m_b20">第三条 <span class="margin-left1">服务约定</span></p>
      <p class="m_b20">3.1 本协议第1.6(c)规定的收益权转让，由第三方服务提供商为您提供，如因前述交易中您与第三方服务提供商产生纠纷的，我行将协助您与第三方服务提供商进行处理，但不为此承担责任。</p>
      <p class="m_b20">3.2 本协议第1.6(c)规定的收益权转让，我行仅根据指令划转资金，对相应电子大额存单存款的质押状态予以记录。</p>
      <p class="m_b20">3.3 本协议第1.6(c)规定的收益权转让，是第三方服务提供商通过银行平台向您提供的服务，您认可并同意，如第三方服务提供商不再提供收益权转让服务的，您同意我行按照《储蓄管理条例》、本协议规定及监管要求为您办理本服务项下定期存款支取业务。</p>
      <p class="m_b20">3.4 未经我行的书面同意，您不得将定期存款的收益权转让给未经我行认可的第三方服务提供商。第三方服务提供商的范围以银行平台展示为准。</p>
      <p class="m_b20">3.5 签约账户在本协议第1.6(c)条约定下进行收益权转让后，为保证该笔定期存款收益权受让人的权益，在该笔收益权转让的定期到期前，签约银行账户不允许销户。</p>
      <p class="m_b20">第四条 <span class="margin-left1">协议的适用法律及争议解决方式</span></p>
      <p class="m_b20">本协议适用中华人民共和国法律。本协议在履行过程中发生争议，可以协商解决，协商不成，可向协议签订地及履行地人民法院起诉。在诉讼期间，本协议不涉及争议部分的条款仍须履行。</p>
      <p class="m_b20">第五条 <span class="margin-left1">协议的生效及其他</span></p>
      <p class="m_b20">5.1 本协议<span>自您在银行平台点击接受本协议，并由我行确认为您提供本服务之日起生效。</span></p>
      <p class="m_b20"> 5.2 本协议的相关约定被监管或司法部门认定为无效或不再适用的，不影响其他条款的效力。</p>
    </div>
  </section>
</div>
</template>
<script>
import { mapState, mapActions, mapGetters } from 'vuex'
import types from '../../store/types.js'
import * as ald from '../../util/ald';
import CommonHeader from '../../components/Common_Header'


export default {
    data: function () {
        return {
          options:{
            title:"定活通支取服务协议",  //头部
            showIcon:false,   //是否展示头部右侧按钮  默认false
            rightButtonText:'',//头部右侧按钮文本
            isSetBack:true,//是否设置头部返回按钮  默认false 如果设置为true
            setSelfShow:false //如果用户自己设置了分享，将不处理右边按钮   默认true
          },
        };
    },
    computed: {

    },
    created () {

    },
    methods: {
      // 左边头部按钮
      leftButtonCallback:function() {
        let h = window.location.href;
        let item = h.indexOf("orderDetail") === -1? "withdrawPage":"orderDetailPage";
        let urlFor = h.indexOf("orderDetail") === -1? "./withdraw.html":"./order_detail.html";
        if(ald.env.isBrowser){
          location.href = urlFor;
        }else{
          ald.nav.forward({url:item});
        }
      }
    },
    components:{
        CommonHeader
    }
}
</script>
